systec-electronic/yocto-sysworxx/sources/meta-sysworxx/pin-muxing/sysworxx-pi/pi-pinmux-0.syscfg
iMMC11.SDCD.pu_pd                  = "pu";
iMMC11.SDCD.$assign                = "MMC1_SDCD";
iMMC11.SDCD.$used                  = true;
const iMMC21                       = scripting.addPeripheral("MMC2");
iMMC21.$useCase                    = "MMC2_3";
iMMC21.$name                       = "MMC2-WIFI";
iMMC21.$assign                     = "MMC2";
iMMC21.$assignVoltage              = "3.3 V";
iMMC21.CMD.pu_pd                   = "pu";
iMMC21.CMD.$assign                 = "MMC2_CMD";
iMMC21.CLK.$assign                 = "MMC2_CLK";
iMMC21.DAT0.pu_pd                  = "pu";
iMMC21.DAT0.$assign                = "MMC2_DAT0";
iMMC21.DAT1.pu_pd                  = "pu";
iMMC21.DAT1.$assign                = "MMC2_DAT1";
iMMC21.DAT2.pu_pd                  = "pu";
iMMC21.DAT2.$assign                = "MMC2_DAT2";
iMMC21.DAT3.pu_pd                  = "pu";
iMMC21.DAT3.$assign                = "MMC2_DAT3";
const iRGMII1                      = scripting.addPeripheral("RGMII");
iRGMII1.$name                      = "RGMII1";
iRGMII1.$assign                    = "RGMII1";
iRGMII1.$assignVoltage             = "3.3 V";
iRGMII1.RD0.$assign                = "RGMII1_RD0";
iRGMII1.RD1.$assign                = "RGMII1_RD1";
iRGMII1.RD2.$assign                = "RGMII1_RD2";
iRGMII1.RD3.$assign                = "RGMII1_RD3";
iRGMII1.RXC.$assign                = "RGMII1_RXC";
iRGMII1.RX_CTL.$assign             = "RGMII1_RX_CTL";
iRGMII1.TD0.rx                     = false;
iRGMII1.TD0.$assign                = "RGMII1_TD0";
iRGMII1.TD1.rx                     = false;
iRGMII1.TD1.$assign                = "RGMII1_TD1";
iRGMII1.TD2.rx                     = false;
iRGMII1.TD2.$assign                = "RGMII1_TD2";
iRGMII1.TD3.rx                     = false;
iRGMII1.TD3.$assign                = "RGMII1_TD3";
iRGMII1.TXC.rx                     = false;
iRGMII1.TXC.$assign                = "RGMII1_TXC";
iRGMII1.TX_CTL.rx                  = false;
iRGMII1.TX_CTL.$assign             = "RGMII1_TX_CTL";
const iRGMII2                      = scripting.addPeripheral("RGMII");
iRGMII2.$name                      = "RGMII2";
iRGMII2.$assign                    = "RGMII2";
iRGMII2.$assignVoltage             = "3.3 V";
iRGMII2.RD0.$assign                = "RGMII2_RD0";
iRGMII2.RD1.$assign                = "RGMII2_RD1";
iRGMII2.RD2.$assign                = "RGMII2_RD2";
iRGMII2.RD3.$assign                = "RGMII2_RD3";
iRGMII2.RXC.$assign                = "RGMII2_RXC";
iRGMII2.RX_CTL.$assign             = "RGMII2_RX_CTL";
iRGMII2.TD0.rx                     = false;
iRGMII2.TD0.$assign                = "RGMII2_TD0";
iRGMII2.TD1.rx                     = false;
iRGMII2.TD1.$assign                = "RGMII2_TD1";
iRGMII2.TD2.rx                     = false;
iRGMII2.TD2.$assign                = "RGMII2_TD2";
iRGMII2.TD3.rx                     = false;
iRGMII2.TD3.$assign                = "RGMII2_TD3";
iRGMII2.TXC.rx                     = false;
iRGMII2.TXC.$assign                = "RGMII2_TXC";
iRGMII2.TX_CTL.rx                  = false;
iRGMII2.TX_CTL.$assign             = "RGMII2_TX_CTL";
const iSPI1                        = scripting.addPeripheral("SPI");
iSPI1.$useCase                     = "SPI_1";
iSPI1.$name                        = "SPI1";
iSPI1.$assign                      = "SPI1";
iSPI1.$assignVoltage               = "3.3 V";
iSPI1.CLK.rx                       = false;
iSPI1.CLK.$assignAllowConflicts    = "OSPI0_D5";
iSPI1.D0.$assignAllowConflicts     = "OSPI0_D6";
iSPI1.D1.$assignAllowConflicts     = "OSPI0_D7";
iSPI1.CS0.$assignAllowConflicts    = "OSPI0_D4";
const iSYSTEM1                     = scripting.addPeripheral("SYSTEM");
iSYSTEM1.$name                     = "SYSTEM0";
iSYSTEM1.$assign                   = "SYSTEM0";
iSYSTEM1.$assignVoltage            = "3.3 V";
iSYSTEM1.CLKOUT0.$assign           = "EXT_REFCLK1";
iSYSTEM1.CLKOUT0.$used             = true;
iSYSTEM1.EXTINTn.$assign           = "EXTINTn";
iSYSTEM1.EXTINTn.$used             = true;
iSYSTEM1.PORz_OUT.$assign          = "PORz_OUT";
iSYSTEM1.RESETSTATz.$assign        = "RESETSTATz";
iSYSTEM1.RESET_REQz.$assign        = "RESET_REQz";
const iUART1                       = scripting.addPeripheral("UART");
iUART1.$useCase                    = "UART_5";
iUART1.$name                       = "UART0-Service";
iUART1.$assign                     = "USART0";
iUART1.$assignVoltage              = "3.3 V";
iUART1.RXD.pu_pd                   = "pu";
iUART1.RXD.$assign                 = "UART0_RXD";
iUART1.TXD.pu_pd                   = "pu";
iUART1.TXD.$assign                 = "UART0_TXD";
const iUART2                       = scripting.addPeripheral("UART");
iUART2.$useCase                    = "UART_5";
iUART2.$name                       = "UART6-USB_UART_Cereal";
iUART2.$assign                     = "USART6";
iUART2.RXD.$assign                 = "MCASP0_AXR3";
iUART2.TXD.$assign                 = "GPMC0_WPn";
const iUART3                       = scripting.addPeripheral("UART");
iUART3.$useCase                    = "UART_5";
iUART3.$name                       = "UART4";
iUART3.$assign                     = "USART4";
iUART3.$assignVoltage              = "3.3 V";
iUART3.RXD.pu_pd                   = "pu";
iUART3.RXD.$assignAllowConflicts   = "MMC2_SDCD";
iUART3.TXD.$assignAllowConflicts   = "MMC2_SDWP";
const iUSB1                        = scripting.addPeripheral("USB");
iUSB1.$name                        = "USB0";
iUSB1.$assign                      = "USB0";
iUSB1.$assignVoltage               = "3.3 V";
iUSB1.DM.$assign                   = "USB0_DM";
iUSB1.DP.$assign                   = "USB0_DP";
iUSB1.DRVVBUS.$used                = false;
iUSB1.RCALIB.$assign               = "USB0_RCALIB";
iUSB1.VBUS.$assign                 = "USB0_VBUS";
const iUSB2                        = scripting.addPeripheral("USB");
iUSB2.$name                        = "USB1";
iUSB2.$assign                      = "USB1";
iUSB2.$assignVoltage               = "3.3 V";
iUSB2.DM.$assign                   = "USB1_DM";
iUSB2.DP.$assign                   = "USB1_DP";
iUSB2.DRVVBUS.$used                = false;
iUSB2.RCALIB.$assign               = "USB1_RCALIB";
iUSB2.VBUS.$assign                 = "USB1_VBUS";
const iWKUP_SYSTEM1                = scripting.addPeripheral("WKUP_SYSTEM");
iWKUP_SYSTEM1.$name                = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assign              = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assignVoltage       = "3.3 V";
iWKUP_SYSTEM1.WKUP_CLKOUT0.$assign = "WKUP_CLKOUT0";
iWKUP_SYSTEM1.PMIC_LPM_EN0.$assign = "PMIC_LPM_EN0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
iGPIO1.$suggestSolution    = "GPIO0";
iMCU_I2C1.$suggestSolution = "MCU_I2C0";
iMDIO1.$suggestSolution    = "MDIO0";
